a-journey.org
#+TITLE: A Journey
#+DATE: <2021-04-28 Wed 23:48>
We never thought about giving up. We stood up for what the real value is. we fought for the right reason but without asking for payoff. We passed the brambles, the toughest time - for the right thing. We worked for the efficiency improvement, little by little, again and again, never compromise, never ever. We sacrificed, we cared about the end users, as we always believe - we are contributing ideas, we are building good things, and we can talk on same basis, act in agreement, make things happen together...But we are on a lonely journey, I don't want to see it off-track and away from the right way, all because that's so important to me...
