a-journey.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A Journey</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jason Tian" />
<link rel="stylesheet" type="text/css" href="./css/worg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">A Journey</h1>
<p>
We never thought about giving up. We stood up for what the real value is. we fought for the right reason but without asking for payoff. We passed the brambles, the toughest time - for the right thing. We worked for the efficiency improvement, little by little, again and again, never compromise, never ever. We sacrificed, we cared about the end users, as we always believe - we are contributing ideas, we are building good things, and we can talk on same basis, act in agreement, make things happen together&#x2026;But we are on a lonely journey, I don't want to see it off-track and away from the right way, all because that's so important to me&#x2026;
</p>
</div>
<div id="postamble" class="status">
<hr />
<p><a href="//jsntn.com">Jason Tian</a><br /><span class="timestamp-wrapper"><span class="timestamp">&lt;2021-04-28 Wed 23:48&gt;</span></span></p>
</div>
</body>
</html>
